Charotty/Pacman-stm32f401re-arduiono/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LCD_DC_Pin GPIO_PIN_2
#define LCD_DC_GPIO_Port GPIOA
#define LCD_RES_Pin GPIO_PIN_3
#define LCD_RES_GPIO_Port GPIOA
#define LCD_CS_Pin GPIO_PIN_6
#define LCD_CS_GPIO_Port GPIOA
#define START_Pin GPIO_PIN_5
#define START_GPIO_Port GPIOA
#define FIRE_Pin GPIO_PIN_9
#define FIRE_GPIO_Port GPIOA
#define DOWN_Pin GPIO_PIN_10
#define DOWN_GPIO_Port GPIOA
#define RIGHT_Pin GPIO_PIN_11
#define RIGHT_GPIO_Port GPIOA
#define LEFT_Pin GPIO_PIN_12
#define LEFT_GPIO_Port GPIOA
#define UP_Pin GPIO_PIN_15
#define UP_GPIO_Port GPIOA

// Joystick KY-023 pins
#define JOYSTICK_X_Pin GPIO_PIN_0  // PA0 - ADC1_IN0
#define JOYSTICK_X_GPIO_Port GPIOA
#define JOYSTICK_Y_Pin GPIO_PIN_1  // PA1 - ADC1_IN1
#define JOYSTICK_Y_GPIO_Port GPIOA
#define JOYSTICK_SW_Pin GPIO_PIN_6  // PA6 - Button
#define JOYSTICK_SW_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
